Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: To provide all users a decent experience for building their projects and packages as well as supporting regular weekly builds of MeeGo on different architectures, the MeeGo OBS farm currently deploys 36 build hosts with at least 16 CPU cores and 32 GB of RAM per host.
ja: すべてのユーザーが、プロジェクトやパッケージをビルドしたり、複数のアーキテクチャ向けに MeeGo を毎週ビルドしたりできるような、優れたエクスペリエンスを提供するために、MeeGo OBS ファームは、現在、 36 個のビルドホストをデプロイしています。これらの各ビルド ホストには、最低 16 個の CPU コアと 32 GB の RAM があります。

source: If a company fails to establish base line compliance, it is almost a guarantee that future revisions of the same product (or other products built using the initial base line) will have compliance issues.
ja: ベース ライン コンプライアンスの構築に失敗した場合は、ほぼ間違いなく、同じ製品の後の改版においても、あるいは最初のベース ラインを使用して構築したその他の製品においても、コンプライアンス問題を抱えることになります。

source: - Review and approve usage, modification, distribution of FOSS
ja: FOSS の使用、改変、配布に関するレビューと承認を行う

source: Companies using FOSS in their products need to:
ja: 自社製品に FOSS を使用している企業は、以下の作業を行う必要があります。

source: - It speeds innovation and adoption of new products and services since the organization is able to safely adopt FOSS components and use them as enablers for services and products
ja: 組織が安全に FOSS コンポーネントを導入し、それらをサービスや製品に実際に使用できるため、新しい製品やサービスの技術革新と導入が加速される

source: Achieving a standard format for package and license metadata will enable companies to exchange software bills of material in a meaningful way.
ja: パッケージやライセンス メタデータの標準が形成されれば、企業はソフトウェアの構成表 (BoM) をいろいろな目的に交換することができます。◆◆

source: Two Days
ja: 2 日間

source: Access source code via git: http://git.linuxfoundation.org/?p=dep-checker.git
ja: git でソース コードにアクセス: http://git.linuxfoundation.org/?p=dep-checker.git

source: The FOSSology Project
ja: FOSSology プロジェクト

source: The V1.0 work was open and public to anyone who joined the effort, but was not open to the public, per se.
ja: バージョン 1.0 は、この活動の参加者全員に公開されましたが、正確には、一般公開されたとは言えません。

source: Job descriptions created by the schedulers are received by the dispatcher.
ja: スケジューラーによって作成されたジョブ仕様書を、ディスパッチャーが受け取ります。

source: A web user interface displays results while the database and file repository remain for future scans and data mining.
ja: Web ユーザー インタフェースに結果が表示され、さらに、データベースとファイル リポジトリが、今後のスキャンやデータ マイニング用に保存されます。

source: The tool maintains a database of keywords to recognize in source code files to ensure code released is safe and ready for public consumption.
ja: このツールは、ソース コード ファイルから削除するべきキーワードをデータベース化することにより、安全で公にすることのできるコード リリースを保証します。

source: Corporate Management
ja: 企業の管理者層

source: Work has been underway via in-person meetings and a project Wiki, and a website, http://spdx.org up and evolving..
ja: 作業は、直接ミーティング、プロジェクトの Wiki、および http://spdx.org サイトで進行しています。

source: Developers can schedule the Packages they are working on for building on the build service.
ja: ◆開発者は、ビルド サービス上で、ビルド用に扱うパッケージをスケジュールできます。◆

source: The Open Source Executive Committee (OSEC) consists of engineering, legal and product marketing executives in addition to the Compliance Officer.
ja: オープン ソース 実行委員会 (OSEC) は、エンジニアリング、リーガル、プロダクト マーケティングの実行委員、およびコンプライアンス オフィサーで構成されます。

source: Mandate design reviews as part of the existing software development process.
ja: ソフトウェア開発プロセスの一環として、設計レビューを義務付ける

source: Roles and responsibilities
ja: 役割と責任

source: Drivers
ja: ドライバー

source: This white paper is a second in a series that focus on the practical aspects of ensuring free and open source software (FOSS) compliance in the enterprise.
ja: このホワイトペーパーは、企業におけるフリー & オープン ソース ソフトウェア (FOSS) のコンプライアンス (法令・契約などの順守) を実行する実務的側面に焦点を当てたシリーズの第二弾です。

source: A distinction should be made between process goals and the practices implemented to achieve those goals.
ja: プロセスの目的と、その目的を達成するために実行するプラクティスとを区別する必要がある。

source: The organization investigates the third party supplier's use of OSS and its OSS compliance practices as part of its supplier selection process.
ja: 組織は、サプライヤー選定プロセスの一環として、サードパーティ サプライヤーが利用している OSS と、その OSS のコンプライアンス プラクティスを調査する。

source: The person in any of these roles is responsible for Open Source strategy, compliance and driving contributions.
ja: このような役割の人物が、オープン ソース戦略、コンプライアンス、および貢献推進の責任を負います。

source: How to respond to and resolve compliance inquiries
ja: コンプライアンスの照会への対応と解決

source: However, unlike the core team, members of the extended team are only working on compliance on-demand, based on tasks they receive from the OSRB.
ja: ただしコア チームとは異なり、拡張チームのメンバーは、OSRB からの要請を受けて、必要に応じてコンプライアンスに取り組みます。

source: Verification
ja: 検証

source: Achieving FOSS Compliance in the Enterprise
ja: 企業における FOSS コンプライアンスの履行

source: There are formal and informal training methods; formal methods may include instructor-led training courses where employees have to pass an exam to pass the course; i nformal methods may include webinars, brown bag seminars, and presentations given to new hires as part of the new employee orientation session.
ja: 公式なトレーニングと非公式のトレーニングがあります。公式なものには、インストラクターが担当するトレーニング コースで、従業員が試験に合格することでコースを修了できるものなどがあります。非公式なものには、ウェビナー (Web 上で受講できるトレーニング)、ブラウンバッグ セミナー、新入社員のオリエンテーション セッションに含まれている新人向けプレゼンテーションなどがあります。

source: The Linux Foundation promotes, protects and advances Linux by providing unified resources and services needed for open source to successfully compete with closed platforms.
ja: The Linux Foundation は、Linux の普及促進、保護、ならびに発展に取り組み、Linux/OSS がクローズドなプラットフォームに対抗するのに必要とされる統合されたリソースとサービスを提供します。

source: LF488 Implementation and Management of Open Source Compliance.
ja: LF488 オープン ソース コンプライアンスの実装と管理

source: The Linux Foundation's MeeGo workgroup welcomes contributors and encourages developers and others to get involved at the site or find out more about joining the Linux Foundation at http://www.linuxfoundation.org/meego.
ja: The Linux Foundation の MeeGo ワークグループでは、コントリビューターを募集しています。詳細情報について、および参加をご希望の開発者やその他の協力者の方は、The Linux Foundation の Web サイト <http://www.linuxfoundation.org/meego> をご覧ください。

source: Booting from External Removable Media
ja: 外部リムーバル メディアからのブート

source: It is important to note that a FOSS software component is approved based on a specific version and usage in a specific product version.
ja: ただし重要なのは、これは、対象のバージョンの FOSS コンポーネントを対象のバージョンの製品で使用することだけを承認するものだということです。

source: It runs Linux in several flavors.
ja: 複数の Linux ディストリビューションに対応しています。

source: Comply with 3rd party software supplier contractual obligations
ja: サード パーティ ソフトウェア サプライヤーの契約義務を順守する

source: Part 1 of 2
ja: パート Ⅰ

source: To learn more about The Linux Foundation, the MeeGo project or our other initiatives, please visit us at http://www.linuxfoundation.org/.
ja: The Linux Foundation、MeeGo プロジェクト、およびその他の活動については、http://www.linuxfoundation.org/ を参照してください。

source: The business environment was predictable and companies mitigated potential risks through license and contract negotiations with the software vendors.
ja: そのようなビジネス環境は予測可能であり、企業は、ソフトウェア ベンダーとのライセンス交渉や契約交渉によって、潜在的リスクを低減していました。

source: The license scanner searches for license fingerprints but does not record where those fingerprints are found in the file.
ja: ライセンス スキャナーは、ライセンスのフィンガープリントを検索するが、そのフィンガープリントがファイルのどこにあるかを記録しない。

source: Diligence practices should be updated to require FOSS disclosure and include guidance regarding the review of any disclosed FOSS and licenses.
ja: FOSS の開示を要求し、公開されているあらゆる FOSS とライセンスのレビューに関する説明を含めるために、精査業務を更新する必要があります。

source: Some of this interest is being driven by more and more companies demanding that suppliers provide them with a Bill of Materials that states clearly which software components are in a specific package, and which licenses are represented.
ja: 関心が高まっている理由の 1 つとして、サプライヤーに部品構成表 (BoM) の提供を求める企業が増えていることが挙げられます。BoM は、パッケージにどのようなソフトウェア コンポーネントが含まれているか、どのようなライセンスが適用されているかを明確に示します。

source: - Reports on compliance activities to the OSEC including flagging any issues that stand in the way of shipping a product
ja: 製品の出荷を阻んでいる問題を警告するなど、コンプライアンス活動について、OSEC に報告する

source: Jonathan Corbet, Editor at LWN.net & Linux Foundation Technical Advisory Board Member
ja: Jonathan Corbet (LWN.net エディター兼 Linux Foundation テクニカル アドバイザリ ボード メンバー)

source: Also check out uClinux for microcontrollers.
ja: また、マイクロコントローラー向けの uClinux についても調べてみてください。

source: e)The portal is organized in a clear and meaningful way to provide users easy access to products' licensing information and, if appropriate, source code.
ja: e) 利用者が、製品のライセンス情報や、場合によってはソース コードに簡単にアクセスできるような、わかりやすく有用なポータルを提供する。

source: Review and Approval
ja: 調査と承認

source: Legal representative also provides advise on licensing conflicts in relation to incompatible or conflicting license obligations.
ja: また法律顧問は、両立性のないライセンス義務に関するライセンス問題についても助言を行います。

source: External communications can take one of several forms:
ja: 外部とのコミュニケーションには、以下のような種類があります。

source: How to implement an end-to-end compliance management program
ja: 具体的なコンプライアンス管理プログラムの実装方法

source: Build service builds as well as local developer builds utilize the exact same toolchain.
ja: ビルド サービスのビルドとローカルな開発者のビルドは、全く同じツールチェーンを利用します。

source: LF384 Overview of Open Source Compliance End-to-End Process.
ja: LF384 オープン ソース コンプライアンスの詳細プロセス概要

source: A combination of any of the above sources
ja: 以上の入手方法を組み合わせたもの

source: Final Verifications
ja: 最終確認

source: A Compliance Directory and Rapid Alert System:
ja: コンプライアンス ディレクトリと緊急警報システム:

source: Compiling all the obligations and notices related to the use of FOSS
ja: FOSS の使用に関するすべての義務と告知を編集する

source: For MeeGo and OBS the following courses provide in-depth information and hands-on experience:
ja: MeeGo および OBS の詳細情報や演習などが含まれたコースは、下記のとおりです。

source: In the future, if the same files are ever uploaded again for scanning in FOSSology, any scan previously done does not have to be repeated since the results of the previous scan have been saved in the FOSSology database and all the component files are saved in the FOSSology file repository by the hash (sha1.md5.size) of their contents.
ja: その後、FOSSology のスキャン対象に同じファイルがアップロードされても、繰り返しスキャンされることはありません。なぜなら前回のスキャン結果は FOSSology データベースに保存されており、さらにすべてのコンポーネント ファイルの内容のハッシュ (sha1.md5.size) が FOSSology ファイル リポジトリに保存されているからです。◆◆

source: Free and Open Source Software
ja: フリー & オープン ソース ソフトウェア

source: Incorporate compliance as part of the development process (discussed earlier)
ja: 開発プロセスの一部にコンプライアンスを組み込む (前述)

source: License compliance - a first step to doing the right thing
ja: ライセンス コンプライアンス - 正しい行動をとるための第一ステップ

source: - Internal package owner
ja: 社内のパッケージ所有者

source: The scheduler calculates the build dependencies across all packages in all projects and repositories and creates the build job descriptions.
ja: スケジューラーは、全プロジェクトの全パッケージとリポジトリのビルド依存関係を計算し、ビルド ジョブ仕様書を作成します。

source: For example, power management is paramount in battery-operated devices.
ja: たとえば、パワー マネジメントは、電池式機器にとっては最優先問題です。

source: A facilitated discussion of checklist questions may be fruitful in achieving a consensus view of capability and gaining perspective on improvement possibilities.
ja: チェックリストの質問から生まれた議論によって、実施すべき活動に関する合意が得られたり、改善の見通しがついたりする可能性があります。

source: Getting Involved with MeeGo Cont.
ja: MeeGo コントリビューションに参加する

source: - The source code packages (including modifications) have been verified to match the binary equivalent shipping in the product
ja: ソース コード パッケージ (改変も含む) が、製品内のバイナリに対応していること。

source: - Incoming request to use a FOSS component
ja: FOSS コンポーネントを使用したいというリクエストを受けた

source: Training will be offered live on-site or online.
ja: トレーニングの受講はオンサイトでもオンラインでも可能です。

source: They may not be particularly useful, which is why each installation should create their own.
ja: あまり有用ではないかもしれませんので、各自でユニークなものを作成してください。◆

source: The recipe typically consists of autoconf scripts to automatically configure the source packages and other files telling the build system and the tools on how to process the input.
ja: レシピは、通常、autoconf スクリプトで作成されており、入力データの処理方法をビルド システムとツールに知らせて、ソース パッケージとその他のファイルを自動的に構成します。◆

source: A one-day comprehensive review of the compliance process, covering what must be done and recommending approaches to instantiating a compliance process.
ja: コンプライアンス プロセスに関する 1 日コースの総合レビュー。行うべきプロセスの説明、およびコンプライアンス プロセスのインスタンス化への取り組みの勧め。◆

source: The product team systematically identifies all the software and additional materials that must be subjected to compliance analysis.
ja: 製品担当チームは、コンプライアンス分析を行うべきすべてのソフトウェアおよびその他の要素を体系的に識別すること。

source: Acknowledge the use of FOSS by providing full copyright and attribution notices.
ja: 完全な著作権告知および帰属告知を提供し、FOSS を使用していることを表明します。

source: List of files flagged with the GPL_v3 or greater license
ja: GPL_v3 以降のライセンスを持つファイルのリスト

source: The Signer Process
ja: サイナー (Signer) プロセス

source: In addition, the OSRB serves as steering committee to define and manage the company's FOSS strategy
ja: また OSRB は、企業の FOSS 戦略を定義および管理するステアリング コミッティの役割も果たします。

source: The goal of the architecture review is to analyze the interactions between the FOSS code and third party and proprietary code.
ja: アーキテクチャ レビューの目的は、FOSS コードと、サードパーティ コードやプロプライエタリ コードとの間の相関関係を解析することです。

source: Community Contributions concerns itself with the review and approval of employee contributions to community projects, as well as company contributions of code and other resources to community projects.
ja: 「コミュニティへの貢献」プロセスは、従業員によるコミュニティ プロジェクトへの貢献、および企業によるコミュニティ プロジェクトへのコードやその他のリソースの貢献について、調査および承認します。

source: Companies often conduct the architecture review with the architect responsible of the product in question in addition to the developers responsible for the various key software components.
ja: 通常、アーキテクチャ レビューには、対象製品の担当アーキテクトと、重要なソフトウェア コンポーネントの開発担当者を参加させます。

source: After all, with almost 2,000 licenses out there, it’s clear that not all licenses will be compatible.
ja: とにかく、約 2,000 種類のライセンスが存在する中で、すべてのライセンスに両立性があるわけではないことは明らかです。

source: The author would like to express his gratitude to Karen Copenhaver (Legal Director of the Linux Foundation and Partner in Choate, Hall & Stewart LLP ‘s Business & Technology practice) and to Philip Koltun (The Linux Foundation Director of Open Compliance Program) for their reviews and valuable input.
ja: このホワイトベーパーの作成にあたっては、Karen Copenhaver 氏 (Linux Foundation のリーガル ディレクター兼 Choate, Hall & Stewart LLP 社 Business & Technology practice 所属のパートナー)、ならびに Philip Koltun 氏 (The Linux Foundtion の Open Compliance Program ディレクター) から貴重なレビューやアドバイスをいただきました。ありがとうございました。

source: The practices included in the checklist below are discussed at some length in the training courses.
ja: このチェックリストに含まれているプラクティスは、そのトレーニング コースで詳細に説明されます。

source: Community contributions are reviewed and approved according to a defined process.
ja: 定義されたプロセスに従って、コミュニティへの貢献が調査され、承認されること。

source: In this step, the software component is either approved for usage in the product or not.
ja: ここでは、対象のソフトウェア コンポーネントを製品に使用してよいかどうかを決定します。

source: Companies can use the Self-Assessment Checklist as a confidential internal tool to assess their progress in implementing a rigorous compliance process and help them prioritize their process improvement efforts.
ja: 企業は、このチェックリストを社内ツールとして使用することにより、コンプライアンス プロセス実装の進捗状況を評価したり、プロセス改善活動の優先順位を決定したりすることができます。

source: Prospective members of the open source review board.
ja: オープン ソース調査委員会のメンバー候補

source: There are limited authorization controls and no group access controls.
ja: 認証機能に制約があり、グループ アクセス制御機能がない。

source: We also now have the momentum, structure and infrastructure in place to work more publicly.
ja: 現在の私たちには、公に働きかける勢い、構造、基盤がそろっています。

source: The Foundation has developed a set of tools to complement commercial and open source scanning tools that identify the origin and license of source code.
ja: LF では、既存の商用およびオープン ソースのスキャニング ツールを補完し、ソース コードの作成元やライセンスを識別するツール群を開発しました。

source: The reason why a violation is believed to exist
ja: 違反があると考えられる理由

source: Binary Scanning Tool
ja: バイナリ スキャン ツール (Binary Scanning Tool)

source: The goal of a compliance process, as with any process, is to achieve consistent and expected business results from its use.
ja: コンプライアンス プロセスを使用する目的は、他のプロセスと同じく、期待どおりの着実なビジネスを達成することです。

source: Understanding what must be done to comply with license obligations takes knowledge and discipline.
ja: ライセンス義務履行のために行うべきことを理解するには、知識と訓練が必要です。

source: Training modules cover the fundamentals of open source licensing and compliance activities and can be tailored for audiences ranging from corporate executives to working professionals.
ja: トレーニング モジュールは、オープン ソース ライセンスやコンプライアンス活動の基本原理を網羅しているほか、企業のエグゼクティブ層から現場のプロに至るまで、幅広い受講者向けにカスタマイズすることができます。

source: However, once this is done OBS greatly automates the steps and creates consistent results.
ja: ただしひととおり完了すると、OBS がそのステップを自動化し、一貫性のある結果を生成してくれます。

source: FOSSology Overview
ja: FOSSology 概要 (英語)

source: Mandate Basic Rules
ja: 基本的ルールの設定

source: In the following paper, we will continue discussing this topic with emphasis on FOSS compliance considerations in relation to source code modifications, notices, distribution, software design, usage, linkages and source code mixing.
ja: パートⅡでは、ソースコードの改変、告知、配布、ソフトウェア設計、利用、リンク、コード混合などに関する FOSS コンプライアンスの考慮事項について取り上げます。

source: The Linux Foundation has created a directory of compliance officers at companies using Linux and Open Source software in their commercial products so communication can be eased, information related to open source licenses can be easily disseminated and actions can be coordinated.
ja: The Linux Foundation では、Linux/OSS を商用製品で活用する企業のコンプライアンス担当者の連絡簿を作成しました。

source: Its use is entirely voluntary.
ja: 使用するかどうかは、完全に任意です。

source: If you use FOSS in your product(s) and you do not have a solid FOSS compliance program, then you should consider this paper as a call to action.
ja: 自社製品に FOSS を使用しているが、確固とした FOSS コンプライアンス プログラムがないという場合は、この機会にぜひ取り組んでください。

source: Engineering and Product Teams Representative
ja: エンジニアリング/プロダクト チームの代表者

source: Resolving Issues
ja: 問題解決

source: - Perform linkage analysis review to determine if any FOSS license obligations migrate to proprietary or third party software.
ja: - リンク解析レビューを実行し、FOSS ライセンス義務がプロプライエタリ ソフトウェアやサードパーティ ソフトウェアに移行していないかどうか確認します。

source: A common deployment scheme utilizes one repository server per architecture.
ja: 一般的なデプロイメント スキーマは、アーキテクチャごとに 1 つのリポジトリ サーバーを使用します。

source: Reciprocal licenses, on the other hand, place varying restrictions on re-use and redistribution.
ja: 一方、さまざまな制約が課されたライセンスもあります。

source: b)The organization provides explicit examples of ways to satisfy obligations.
ja: b) 組織は、明確な義務履行方法の例を提供する。

source: From the command line interface
ja: コマンド ライン インタフェースから

source: Once a platform key is installed, the platform operates in user mode, where it will only boot secure operating systems whose signatures are in the signatures database (or are signed by a KEK in the signature database).
ja: プラットフォーム鍵がインストールされると、プラットフォームはユーザー モードで動作し、そこでは、署名データベースに署名を持つ (つまり署名データベース内の鍵交換鍵で署名された) セキュアな OS だけがブートされます。

source: d)The compliance team verifies that source code can be built outside the organization's build environment.
ja: d) コンプライアンス チームは、ソース コードが組織のビルド環境以外でもビルドできることを検証する。

source: Tracking open issues to closure
ja: クローズするべきオープン イシューの追跡

source: The supporting elements are practices that enable an organization to accomplish the goals and objectives of the core compliance processes.
ja: サポート項目というのは、組織がコア コンプライアンス プロセスの目的を果たせるように支援するプラクティスです。

source: The lessons learned from the various non-compliance cases with emphasis on the positive learnings
ja: さまざまなコンプライアンス違反の例から学んだポジティブな教訓

source: Via a URL by providing the URL of the file to analyze
ja: 解析するファイルの URL を指定し、URL 経由で

source: The Open Compliance Program is led by experts in the compliance industry and backed by such organizations as the Adobe, AMD, ARM Limited, Cisco Systems, Google, HP, IBM, Intel, Motorola, NEC, Novell, Samsung, Software Freedom Law Center, Sony Electronics and many more.
ja: オープン コンプライアンス プログラムは、コンプライアンス分野の専門家による主導のもと、Adobe, AMD, ARM Limited, Cisco Systems, Google, HP, IBM, Intel, Motorola, NEC, Nokia, Novell, Samsung, Software Freedom Law Center, Sony Electronics などの企業により支えられています。

source: - Acknowledge the use of FOSS by providing full copyright and attribution notices
ja: 完全な著作権告知および帰属告知を提供し、FOSS を使用していることを表明します

source: Example of a written offer to provide the source code:
ja: 書面によるオファーでソース コードを提供する例:

source: Dependency Management ?
ja: 依存関係の管理

source: Tools used (id, version, when)
ja: ライセンス情報抽出のために使用したツール (ID、バージョン、いつ)

source: - Development in kernel space versus user space
ja: カーネル スペースでの開発対ユーザー スペースでの開発

source: A checklist of recommended practices should prompt companies to assess the extent to which they've institutionalized compliance actions and the degree to which those actions produce needed business results ?
ja: 企業は、推奨されるプラクティスのチェックリストを使用することにより、コンプライアンス活動をどの程度組織化したか、そして、求めていたビジネス成果はコンプライアンス活動によってどの程度達成されたかを自己評価することができます。

source: The Self-Assessment Checklist is constructed using at least two concepts from well-established models of process maturity such as the Software Engineering Institute’s Capability Maturity Model:
ja: この自己診断チェックリストは、Software Engineering Institute の 能力成熟度モデル (Capability Maturity Model: CMM) のような確立されたプロセス成熟度モデルの概念を採用しています。

source: Furthermore, the challenge revolves around establishing a clean software baseline for your product or software platform.
ja: この課題は、あなたの製品やソフトウェア プラットフォームのクリーン ソフトウェア ベースラインを確立することを意味します。

source: - David Turner, GPL Compliance Engineer, Free Software Foundation (09/23/2003, http://lwn.net/Articles/51570)12
ja: - Free Software Foundation GPL コンプライアンス エンジニア、 David Turner (2003 年 9 月 23 日、http://lwn.net/Articles/51570)

source: Building a Linux distribution from scratch can be a daunting task.
ja: Linux ディストリビューションをゼロからビルドするのは、大変です。

source: Architecture Review
ja: アーキテクチャ レビュー

source: Automatic resolution of dependencies avoids inconsistencies by triggering rebuilds of a package if one of its dependencies changes.
ja: 依存関係の自動解決機能が働くため、もし依存関係の中の 1 つが変更されれば、パッケージのリビルドがトリガーされ、整合性が保たれます。

source: Whatever your preference is, you would want the tool to reflect the workflow of your compliance process, allowing you to move compliance tickets from one phase of the process to another, providing you with task and resources management, time tracking, email notifications, project statistic and reporting capabilities.
ja: どちらにしても、それらのツールは、各自のコンプライアンス プロセスのワークフローを反映し、プロセスの段階間でコンプライアンス チケットを移動でき、タスクやリソースの管理、タイム トラッキング、email 告知、プロジェクト計測、レポートなどの機能を持つ必要があります。◆◆

source: Buckets are a method to organize file reports based on your own criteria.
ja: バケットは、各自の条件に基づいてファイル レポートを作成するメソッドです。

source: A repository of OSS packages is maintained and made available to the organization.
ja: OSS パッケージのリポジトリが保守され、組織がそれを利用できるようになっている。

source: Open Compliance Training Data Sheet
ja: オープン コンプライアンス トレーニング データ シート (英語)

source: The X11 license is compatible with the GPL version 2, because works licensed under the X11 license, can be distributed under the terms of the GPL.
ja: X11 ライセンスの下でライセンスされた成果物を GPL version 2 の条件下で配布できるのであれば、X11 ライセンスと GPL version 2 は矛盾していません。

source: Due diligence on the use of FOSS by third party software providers
ja: サード パーティ ソフトウェア プロバイダーよる FOSS 使用を精査する

source: Executive Summary
ja: 要旨

source: No scoring scheme has been provided in this initial version of the checklist.
ja: 今回発表される最初のバージョンのチェックリストは、採点方式にはなっていません。

source: In this whitepaper, we will provide a brief introduction to the MeeGo build infrastructure and how it is utilized to support the MeeGo development process.
ja: このホワイトペーパーでは、MeeGo ビルド基盤を簡単に紹介し、MeeGo 開発プロセスをサポートするための MeeGo ビルド基盤の利用方法について説明します。

source: In the closed model, where the OEM controls the PK, it becomes impossible without an update supplied by the OEM.
ja: さらに、クローズド モデルでは、OEM がプラットフォーム鍵を管理しているため、OEM による更新が提供されなければ不可能です。

source: Distribution Phase
ja: 配布フェーズ

source: That holds particularly true for embedded systems where the software, commonly called firmware, is integrated and delivered with the hardware.
ja: これは、特に組込みシステムに当てはまります。そこでは、ファームウェアとも呼ばれるソフトウェアが組み込まれ、ハードウェアとともに配布されます。
